index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-03-12 Wed 08:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Semi-professional website</title>
<meta name="author" content="selffins" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="styles.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Semi-professional website</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgaf7d287">1. What</a></li>
<li><a href="#orgbdd5a3f">2. Academic Profile</a></li>
<li><a href="#org4368ad0">3. Professional Statement</a></li>
<li><a href="#org59fe9a5">4. Work so far</a></li>
<li><a href="#orgfeab583">5. Other</a></li>
<li><a href="#org61abe3f">6. Music listening</a></li>
<li><a href="#orgfa676a3">7. Curiosities</a></li>
<li><a href="#orgad23d7a">8. Contact</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgaf7d287" class="outline-2">
<h2 id="orgaf7d287"><span class="section-number-2">1.</span> What</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Louis Quilling&rsquo;s website</li>
<li>Aliases: louis,  lewis (it is more unambiguous in pronunciation), equillin, selffins (online identity), that one guy over there</li>
<li>Grammatically male</li>
</ul>
</div>
</div>
<div id="outline-container-orgbdd5a3f" class="outline-2">
<h2 id="orgbdd5a3f"><span class="section-number-2">2.</span> Academic Profile</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Minoring in Principles of Programming Languages and Professional Writing</li>
<li>Louis is a CS undergraduate student at CMU</li>
<li>Primary areas of academic interest: proof theory, interactive theorem provers, formal verification</li>
</ul>
</div>
</div>
<div id="outline-container-org4368ad0" class="outline-2">
<h2 id="org4368ad0"><span class="section-number-2">3.</span> Professional Statement</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>I am a undergraduate CS senior, graduating Spring 2025 from Carnegie Mellon University, in their campus in Qatar. I minored in Principles of Programming Languages (PoPL), which allowed for a broad overview of logic, programming language theory (PLT) and formal methods.</li>
<li>Specifically, I am interested in proof theory and interactive theorem proving, guided by my advisor Giselle Reis (greis@andrew.cmu.edu).</li>
<li>Right now, I am conducting an independent study - learning the Coq theorem prover and using Coq to study proof systems —i.e. mechanized metatheory. I will be extending this work under a grant in a summer undergraduate research program, and develop it into a senior undergraduate thesis with Giselle Reis. The goal is to streamline methods in formalizations of metatheory—particularly by addressing the problem of context representations by evaluating current approaches and possibly developing a novel approach.</li>
<li>I am also minoring in Professional Writing - an aim of mine is to study how to communicate my interests - proof theory/metamathematics and formal methods - to wider audiences.</li>
</ul>
</div>
</div>
<div id="outline-container-org59fe9a5" class="outline-2">
<h2 id="org59fe9a5"><span class="section-number-2">4.</span> Work so far</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Very very very modest, nascent writing portfolio: <a href="https://docs.google.com/document/d/1tXGWEhwr83BrJDGW0OWJKRs60QbKRvY5X-SDSWqY2Dk/edit?usp=sharing">Writing Samples</a>, soon to be made presentable, and crystallized into a blog. I have written mostly for other topics than math, so, this is a recent effort. I connected with some people in PLT recently and I was inspired by discussions - interfield discussions - because when connecting with people in other subfields - you have to think of effective ways of communicating understandably, without losing too much conceptual rigor, and  with a view of how this is applicable.</li>
<li>Current effort is spent on an independent study about formal verification (a reading of the excellent book Software Foundations): <a href="https://selffins.github.io/lf/">https://selffins.github.io/lf/</a></li>
<li>Upcoming project in formalization of metatheory in Coq/Rocq. Specifically, context representations.</li>
<li>Relevant courses taken: functional programming (15150), constructive logic (15317), programming language theory (15312), logic and mechanized reasoning (15311), automated program verification (15414), software foundations of security and privacy (15316), epistemology (80261), an independent study on formal verification / interactive theorem provers, and an upcoming QSIURP proposal on formalized metatheory and a possible thesis project.</li>
<li>In terms of writing: Style (76390), Interpretation and Argument (76101), Argument (76373), Rhetorical Grammar (76389), Corpus Linguistics (76328), Professional Writing (76270), and possibly an upcoming Independent Study in Rhetoric - targeting Scientific Writing for Math/Logic.</li>
</ul>
</div>
</div>
<div id="outline-container-orgfeab583" class="outline-2">
<h2 id="orgfeab583"><span class="section-number-2">5.</span> Other</h2>
<div class="outline-text-2" id="text-5">
<p>
Giving myself the opportunity to state opinions by suspending the sense of cringe, here is a list of opinions or information about me.
</p>

<ul class="org-ul">
<li>Louis likes <a href="https://www.merriam-webster.com/dictionary/pretentious">philosophy</a>, linguistics, psychology, emacs, personal knowledge systems, their cat, and listening to music</li>
<li>I don&rsquo;t like bold statements, but if i had one, this is My Core Mission: to strive for a slower, peaceful, quieter, kinder, more empathic, more reflective world - internal and external</li>
<li>Idealist in principle, reluctant pragmatist in practice</li>
<li>I am 40% on the way to becoming a luddite. I am less and less enthusiastic to call myself a computer scientist - or really, a programmer. I am concerned and skeptic of the role of technology in society right now.</li>
<li>I cannot respect nor be friends with those who do not like pineapple on pizza / hawaiian pizza (depending on how they reason about why they do not like it).</li>
<li>You can learn a lot about people&rsquo;s worldview (and particularly political belief) based on their attitude towards modern art.</li>
<li>I am an aspiring <a href="https://timrodenbroeker.de/digital-garden/">digital</a> <a href="https://maggieappleton.com/garden-history/">gardener</a>.</li>
<li>Louis is looking for friends, conversation, and help (in either direction).</li>
<li>My (unset) world-view: <a href="https://en.wikipedia.org/wiki/Epistemic_humility">Epistemic humility</a>, <a href="https://en.wikipedia.org/wiki/Possibilianism">Possibilianism</a>, <a href="https://en.wikiversity.org/wiki/Beyond_Theism">Beyond Theism</a></li>
<li>My political compass test <a href="https://www.politicalcompass.org/yourpoliticalcompass_js?ec=-7.38&amp;soc=-7.23">results</a>.</li>
<li>I am a logical pluralist, in the same vein as Corcoran (historian of logic).</li>
<li><a href="https://www.npr.org/sections/shots-health-news/2024/11/29/nx-s1-5210688/lonelieness-epidemic-social-isolation-parenting-cohousing">Cohousing</a> is an interesting proposition</li>
<li>I would like to live in the <a href="https://en.wikipedia.org/wiki/Pacific_Northwest">PNW</a>. Pittsburgh was nice. doha is quiet and efficient. I don&rsquo;t think I&rsquo;d mind the rain and cold.</li>
<li>I smash the random article button in wikipedia like how one scrolls through instagram reels or tiktok</li>
<li>I have some pretty good knowledge of geography, linguistics and history. A particularly annoying thing about me is my digression into etymology whenever someone uses an interesting word or name.</li>
<li>I am learning how to write short stories.</li>
<li>I like this artist and other outsider artists: <a href="https://en.wikipedia.org/wiki/Henry_Darger">Henry Darger</a>.</li>
<li>I am not very sure of myself. I am a recovering comic. I am getting better.</li>
</ul>
</div>
</div>
<div id="outline-container-org61abe3f" class="outline-2">
<h2 id="org61abe3f"><span class="section-number-2">6.</span> Music listening</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>My only real hobby is music listening: here is a 1 minute summary in song form about <a href="https://www.youtube.com/watch?v=dKipYHuZUD8">me and music</a></li>
<li>1/4-th of 2024 was spent listening to music</li>
<li>What I am listening to recently: <a href="https://www.last.fm/user/selffins">last.fm</a></li>
<li>What albums are very important to me (the last few months): <a href="https://docs.google.com/presentation/d/e/2PACX-1vTsGrsBRoLqK_A1-vteZXRNs0htwZBgW3mkJAlFBf_awLkMzX8N0HxhCUIaaDQorRnhIS_giurxu7-q/pub?start=false&amp;loop=false&amp;delayms=3000">topsters</a></li>
<li>Look at some of my playlists: <a href="https://open.spotify.com/user/m0zp47pe91bma5yw67nqcsl8k?si=9899e9de39ba4456">spotify</a></li>
<li>I rate music sometimes: <a href="https://rateyourmusic.com/~selffins">rateyourmusic.com/~selffins</a></li>
<li>If you were to get one recommendation of a song from me (as of now): <a href="https://midairthief.bandcamp.com/track/ahhhh-these-chains">Mid-Air Thief - Ahhhh, These Chains!</a></li>
<li>If I were to recommend one album for you to &ldquo;get to know me&rdquo;: <a href="https://carseatheadrest.bandcamp.com/album/how-to-leave-town">Car Seat Headrest - How to Leave Town</a></li>
<li><a href="https://en.wikipedia.org/wiki/Phil_Elverum">Phil Elverum</a>, <a href="https://en.wikipedia.org/wiki/David_Berman_(musician)">David Berman</a>, <a href="https://en.wikipedia.org/wiki/Will_Toledo">Will Toledo</a>, <a href="https://en.wikipedia.org/wiki/Brian_Wilson">Brian Wilson</a>, <a href="https://en.wikipedia.org/wiki/David_Byrne">David Byrne</a>, <a href="https://en.wikipedia.org/wiki/Bj%C3%B6rk">Björk</a> are my heroes</li>
</ul>
</div>
</div>
<div id="outline-container-orgfa676a3" class="outline-2">
<h2 id="orgfa676a3"><span class="section-number-2">7.</span> Curiosities</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>Areas of curiosity: foundations, history, philosophy of mathematics</li>
<li>I <a href="https://www.merriam-webster.com/dictionary/go%20nowhere">swear</a> <a href="https://www.merriam-webster.com/dictionary/poseur">I</a> am going to learn the basics of: haskell, group theory, category theory, homotopy type theory constructive mathematics.</li>
<li>Hoping to read more Godel, Bernays.</li>
<li>Farther areas of curiosity: linguistics, computational linguistics, social computing, analytic philosophy</li>
</ul>
</div>
</div>
<div id="outline-container-orgad23d7a" class="outline-2">
<h2 id="orgad23d7a"><span class="section-number-2">8.</span> Contact</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>email: equillin at cmu dot edu</li>
<li>discord: selffins#0000</li>
<li>facebook for programmers (i.e. github): <a href="https://github.com/selffins">https://github.com/selffins</a></li>
<li>visit me: 54.4296° S, 36.5879° W</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: selffins</p>
<p class="date">Created: 2025-03-12 Wed 08:27</p>
</div>
</body>
</html>
